## Carbon Majors Emissions

In [14]:
# importing the data from kaggle.. make sure you have kaggle.json file in your home directory

!kaggle datasets download -d joebeachcapital/carbon-majors-emissions-data --unzip

^C

In [15]:
# my import statements
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [30]:
# using medium granularity data and pandas to read the data
df = pd.read_csv('emissions_medium_granularity.csv')

In [17]:
df.head()

,year,parent_entity,parent_type,commodity,production_value,production_unit,total_emissions_MtCO2e
0,1962,Abu Dhabi National Oil Company,State-owned Entity,Oil & NGL,0.91250,Million bbl/yr,0.363885
1,1962,Abu Dhabi National Oil Company,State-owned Entity,Natural Gas,1.84325,Bcf/yr,0.134355
2,1963,Abu Dhabi National Oil Company,State-owned Entity,Oil & NGL,1.82500,Million bbl/yr,0.727770
3,1963,Abu Dhabi National Oil Company,State-owned Entity,Natural Gas,4.42380,Bcf/yr,0.322453
4,1964,Abu Dhabi National Oil Company,State-owned Entity,Oil & NGL,7.30000,Million bbl/yr,2.911079

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12551 entries, 0 to 12550
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   year                    12551 non-null  int64
 1   parent_entity           12551 non-null  object
 2   parent_type             12551 non-null  object
 3   commodity               12551 non-null  object
 4   production_value        12551 non-null  float64
 5   production_unit         12551 non-null  object
 6   total_emissions_MtCO2e  12551 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 686.5+ KB

In [19]:
df['production_unit'].value_counts()

production_unit
Million tonnes/yr     5103
Million bbl/yr        3733
Bcf/yr                3452
Million Tonnes CO2     263
Name: count, dtype: int64

In [20]:
df.describe()

               year  production_value  total_emissions_MtCO2e
count  12551.000000      12551.000000            12551.000000
mean    1987.148116        412.677443              113.205850
std       29.202455       1357.538128              329.789848
min     1854.000000          0.004398                0.000321
25%     1973.000000         10.601353                8.785294
50%     1994.000000         63.203536               33.058688
75%     2009.000000        320.664764              102.154596
max     2022.000000      27192.000000             8646.905949

# Time for some Data Pre Processing

In [21]:
# the production unit is not the same metric as some of the other production values

df['production_unit'].value_counts()

production_unit
Million tonnes/yr     5103
Million bbl/yr        3733
Bcf/yr                3452
Million Tonnes CO2     263
Name: count, dtype: int64

In [31]:
# Drop rows where production_unit is not 'Million tonnes/yr'
df = df[df['production_unit'] == 'Million tonnes/yr']

# Display the updated DataFrame
print(df)

       year      parent_entity             parent_type            commodity  \
122    2012  Adani Enterprises  Investor-owned Company  Sub-Bituminous Coal
123    2013  Adani Enterprises  Investor-owned Company  Sub-Bituminous Coal
124    2014  Adani Enterprises  Investor-owned Company  Sub-Bituminous Coal
125    2015  Adani Enterprises  Investor-owned Company  Sub-Bituminous Coal
126    2016  Adani Enterprises  Investor-owned Company  Sub-Bituminous Coal
...     ...                ...                     ...                  ...
12409  2018    Wolverine Fuels  Investor-owned Company      Bituminous Coal
12410  2019    Wolverine Fuels  Investor-owned Company      Bituminous Coal
12411  2020    Wolverine Fuels  Investor-owned Company      Bituminous Coal
12412  2021    Wolverine Fuels  Investor-owned Company      Bituminous Coal
12413  2022    Wolverine Fuels  Investor-owned Company      Bituminous Coal

       production_value    production_unit  total_emissions_MtCO2e
122            4.000000  Million tonnes/yr                8.076362
123            4.090000  Million tonnes/yr                8.258080
124            7.920000  Million tonnes/yr               15.991196
125           10.360000  Million tonnes/yr               20.917777
126           11.450000  Million tonnes/yr               23.118586
...                 ...                ...                     ...
12409          8.216456  Million tonnes/yr               22.300604
12410          7.898938  Million tonnes/yr               21.438816
12411          7.390002  Million tonnes/yr               20.057494
12412          6.209743  Million tonnes/yr               16.854106
12413          5.828721  Million tonnes/yr               15.819960

[5103 rows x 7 columns]

   production_value
0             1.360
1             5.935
2           100.000